app/Vin.php

        }]);
        */

        $results->load( 'stock','condi',
                                'type','prod',
                                'cepa','cont',
                                'met','util',
                                'cotas','photos',
                                'notes', 'comms',
                                'prixprods');
---
select * from `condis` where `condis`.`id` in (1)
select * from `prods` where `prods`.`id` in (1, 2, 3, 4, 5)
select * from `stocks` where `stocks`.`id` in (2)
select * from `types` where `types`.`id` in (1, 2, 3, 4)

    public static function findBio(){

        $results = Vin::select('*')
            ->where("estBio","=",1)
            ->get();
---
select * from `vins` where `estBio` = 1