app/Vin.php

    public static function getData($order){

        $results=Vin::all();

        //->orderBy('vins.nom','asc');

        $results->load( 'stock','condi',
                                'type','prod',
                                'cepa','cont',
                                'met','util',
                                'cotas','photos',
                                'notes','prixprods',
                                'comms');
---
select * from `vins`
select * from `condis` where `condis`.`id` in (1)
select * from `prods` where `prods`.`id` in (1, 2, 3, 4, 5)
select * from `stocks` where `stocks`.`id` in (2)
select * from `types` where `types`.`id` in (1, 2)

    public static function findRedWine(){

        $results = Vin::join('types', 'vins.idType', '=', 'types.id')
            ->select('*')
            ->where("types.label","like","Rouge")
            ->get();
---
select * from `vins` inner join `types` on `vins`.`idType` = `types`.`id` where `types`.`label` like 'Rouge'

    public static function findWhiteWine(){

        $results = Vin::join('types', 'vins.idType', '=', 'types.id')
            ->select('*')
            ->where("types.label","like","Blanc")
            ->get();
---
select * from `vins` where exists (select * from `types` where `vins`.`idType` = `types`.`id` and `label` like 'Rouge')

    public static function findRoseWine(){

        $results = Vin::join('types', 'vins.idType', '=', 'types.id')
            ->select('*')
            ->where("types.label","like","Rosé")
            ->get();
---
select * from `vins` where exists (select * from `types` where `vins`.`idType` = `types`.`id` and `label` like 'Rosé')

    public static function findMousseuxWine(){

        $results = Vin::join('types', 'vins.idType', '=', 'types.id')
            ->select('*')
            ->where("types.label","like","Mousseux")
            ->get();
---
select * from `vins` where exists (select * from `types` where `vins`.`idType` = `types`.`id` and `label` like 'Rouge')

    public static function findBio(){

        $results = Vin::select('*')
            ->where("estBio","=",1)
            ->get();
---
select * from `vins` where `estBio` = 1

    public static function findPrimeur(){

        $results = Vin::select('*')
            ->where("estPrimeur","=",1)
            ->get();
---
select * from `vins` where `estPrimeur` = 1