app/Http/Controllers/CartController.php

    public function index()
    {
        $datas=Vin::all();

        $datas->load( 'stock','condi',
        'type','prod',
        'cepa','cont',
        'met','util',
        'cotas','photos',
        'notes','prixprods');
---
select * from `vins`
select * from `condis` where `condis`.`id` in (1)
select * from `prods` where `prods`.`id` in (1, 2, 3, 4, 5)
select * from `stocks` where `stocks`.`id` in (1)
select * from `types` where `types`.`id` in (1, 2)