app/Http/Controllers/CommentController.php

insert into `comms` (`idVin`, `idUtil`, `titre`, `contenu`, `date`) values ('20', 6, 'big', 'erert', '2019-06-06 09:59:00')
---
    public function store(Request $request)
    {
        //$cancer = $request->request->get('titre');
        //dd($cancer);

        $comment = new Comm();
        $comment->idVin = $request->request->get('idVin');
        $comment->idUtil = Auth::user()->id;
        $comment->titre = $request->request->get('titre');
        $comment->contenu = $request->request->get('contenu');
        $comment->date = date('Y-m-d H:i:s');
        $comment->save();