app/Http/Controllers/HomeController.php

select * from `vins` order by RAND() limit 4
select * from `condis` where `condis`.`id` in (1)
select * from `prods` where `prods`.`id` in (1, 3, 4)
select * from `stocks` where `stocks`.`id` in (2)
select * from `types` where `types`.`id` in (1, 2)
---
    public function index()
    {

        $datas=Vin::inRandomOrder()->take(8)->get();

        //->orderBy('vins.nom','asc');

        $datas->load('stock','condi','type','prod','cepa','cont','met','util','cotas', 'photos', 'notes');

        return view('accueil2')->with('datas', $datas);