app/Http/Controllers/ProductController.php

    public function index(Request $request, $id){

        $x = Vin::find($id);
        $x->load('stock','condi','type','prod','cepa','cont','met','util','cotas', 'photos', 'notes', 'prixprods', 'comms');
---
select * from `condis` where `condis`.`id` in (1)
select * from `prods` where `prods`.`id` in (3)
select * from `stocks` where `stocks`.`id` in (2)
select * from `types` where `types`.`id` in (2)